zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81743/codewarrior/MC56F81743_Vectors.c
/* User could redefine ivINT_eFlexPWMA_RELOAD0.
Please be noted that ivINT_eFlexPWMA_RELOAD0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMA_RELOAD0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMA_RELOAD0(void);
__attribute__((weak)) void ivINT_eFlexPWMA_RELOAD0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMA_CMP0 **********************/

/* User could redefine ivINT_eFlexPWMA_CMP0.
Please be noted that ivINT_eFlexPWMA_CMP0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMA_CMP0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMA_CMP0(void);
__attribute__((weak)) void ivINT_eFlexPWMA_CMP0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for FTFA_RDCOL **********************/

/* User could redefine ivINT_FTFA_RDCOL.
Please be noted that ivINT_FTFA_RDCOL can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_FTFA_RDCOL definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_FTFA_RDCOL(void);
__attribute__((weak)) void ivINT_FTFA_RDCOL(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for FTFA_CC **********************/

/* User could redefine ivINT_FTFA_CC.
Please be noted that ivINT_FTFA_CC can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_FTFA_CC definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_FTFA_CC(void);
__attribute__((weak)) void ivINT_FTFA_CC(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CMPC **********************/

/* User could redefine ivINT_CMPC.
Please be noted that ivINT_CMPC can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CMPC definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CMPC(void);
__attribute__((weak)) void ivINT_CMPC(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CMPB_OPAMPB **********************/

/* User could redefine ivINT_CMPB_OPAMPB.
Please be noted that ivINT_CMPB_OPAMPB can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CMPB_OPAMPB definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CMPB_OPAMPB(void);
__attribute__((weak)) void ivINT_CMPB_OPAMPB(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CMPA_OPAMPA **********************/

/* User could redefine ivINT_CMPA_OPAMPA.
Please be noted that ivINT_CMPA_OPAMPA can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CMPA_OPAMPA definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CMPA_OPAMPA(void);
__attribute__((weak)) void ivINT_CMPA_OPAMPA(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for PIT1_ROLLOVR **********************/

/* User could redefine ivINT_PIT1_ROLLOVR.
Please be noted that ivINT_PIT1_ROLLOVR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_PIT1_ROLLOVR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_PIT1_ROLLOVR(void);
__attribute__((weak)) void ivINT_PIT1_ROLLOVR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for PIT0_ROLLOVR **********************/

/* User could redefine ivINT_PIT0_ROLLOVR.
Please be noted that ivINT_PIT0_ROLLOVR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_PIT0_ROLLOVR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_PIT0_ROLLOVR(void);
__attribute__((weak)) void ivINT_PIT0_ROLLOVR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOF **********************/

/* User could redefine ivINT_GPIOF.
Please be noted that ivINT_GPIOF can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOF definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOF(void);
__attribute__((weak)) void ivINT_GPIOF(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOE **********************/

/* User could redefine ivINT_GPIOE.
Please be noted that ivINT_GPIOE can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOE definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOE(void);
__attribute__((weak)) void ivINT_GPIOE(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOD **********************/

/* User could redefine ivINT_GPIOD.
Please be noted that ivINT_GPIOD can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOD definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOD(void);
__attribute__((weak)) void ivINT_GPIOD(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOC **********************/

/* User could redefine ivINT_GPIOC.
Please be noted that ivINT_GPIOC can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOC definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOC(void);
__attribute__((weak)) void ivINT_GPIOC(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

